Repository: vsuaiqq/dating-service
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

# greeting_start
source: Hi! I'm a dating bot. Ready to begin?
ru: Привет! Я бот знакомств. Готов начать?

# ask_age
source: How old are you?
ru: Сколько тебе лет?

# ask_gender
source: Now let's define your gender
ru: Теперь определимся с полом

# ask_interesting_gender
source: Who are you interested in?
ru: Кто тебе интересен?

# ask_city
source: Which city are you from?
ru: Из какого ты города?

# ask_name
source: What should I call you?
ru: Как мне тебя называть?

# ask_about
source: Tell us about yourself and who you’re looking for, what you’d like to do together. This will help us match you better.
ru: Расскажи о себе и кого хочешь найти, чем предлагаешь заняться. Это поможет лучше подобрать тебе компанию.

# ask_media
source: Now send a photo or record a video 👍 (up to 15 sec), other users will see it.
ru: Теперь пришли фото или запиши видео 👍 (до 15 сек), его будут видеть другие пользователи.

# start_button
source: 🚀 Start
ru: 🚀 Начать

# save_profile_button
source: Yes
ru: Да

# gender_male_button
source: Male
ru: Мужчина

# gender_female_button
source: Female
ru: Женщина

# gender_any_button
source: Any
ru: Неважно

# skip_button
source: Skip
ru: Пропустить

# back_button
source: Back
ru: Назад

# finish_media_button
source: That`s all, save photo
ru: Это все, сохранить photo

# edit_profile_button
source: Change profile
ru: Изменить анкету

# feed_button
source: Show profiles
ru: Смотреть анкеты

# my_profile_button
source: My profile
ru: Моя анкета

# disable_profile_button
source: Disable profile
ru: Отключить анкету

# enable_profile_button
source: Enable profile
ru: Включить анкету

# confirm_disable_profile_button
source: Yes, turn off
ru: Да, отключить

# cancel_disable_profile_button
source: No, leave it
ru: Нет, оставить

# age_range_error
source: Age must be between {min} and {max} years
ru: Возраст должен быть от {min} до {max} лет

# age_numeric_error
source: Please enter age as a number
ru: Пожалуйста, введите возраст цифрами

# name_min_error
source: Name must be at least {min} characters long
ru: Имя должно быть не короче {min} символов

# name_max_error
source: Name must be no longer than {max} characters
ru: Имя должно быть не длиннее {max} символов

# city_min_error
source: City name must be at least {min} characters long
ru: Название города должно быть не короче {min} символов

# city_max_error
source: City name must be no longer than {max} characters
ru: Название города должно быть не длиннее {max} символов

# about_max_error
source: Description must be no longer than {max} characters
ru: Описание должно быть не длиннее {max} символов

# video_duration_error
source: Video must be shorter than {max} seconds
ru: Видео должно быть короче {max} секунд

# media_type_error
source: Please send a photo or video
ru: Пожалуйста, отправьте фото или видео

# file_size_error
source: File must be smaller than {max}MB
ru: Файл должен быть меньше {max}MB

# invalid_gender_error
source: Incorrect gender value
ru: Некорректное значение пола

# profile_preview
source: This is what your profile looks like
ru: Так выглядит твоя анкета

# profile_saved
source: The profile has been saved
ru: Анкета сохранена

# confirm_profile
source: Is everything correct?
ru: Все верно?

# media_added
source: File {now}/{total} saved. You can add {remainder} more files
ru: Файл {now}/{total} сохранен. Вы можете добавить еще {remainder} файлов

# confirm_disable_profile
source: Are you sure you want to disable the profile?
ru: Вы уверены, что хотите отключить анкету?

# profile_disable_canceled
source: Profile disable cancelled
ru: Отключение профиля отменено

# active_status
source: [Active ✅]
ru: [Активно ✅]

# inactive_status
source: [Inactive ❌]
ru: [Неактивно ❌]

# profile_disabled_success
source: Profile has been disabled
ru: Анкета отключена

# profile_enabled_success
source: Profile has been enabled
ru: Анкета включена

# edit_name_button
source: Edit name
ru: Изменить имя

# edit_age_button
source: Edit age
ru: Изменить возраст

# edit_gender_button
source: Edit gender
ru: Изменить пол

# edit_interesting_gender_button
source: Edit interesting gender
ru: Изменить интересующий пол

# edit_city_button
source: Edit city
ru: Изменить город

# edit_about_button
source: Edit about
ru: Изменить текст анкеты

# edit_media_button
source: Edit media
ru: Изменить медиа

# choose_field_to_edit
source: Choose a field to edit
ru: Выберите поле для изменения

# enter_new_name
source: Enter your new name
ru: Введите новое имя

# enter_new_age
source: Enter your new age
ru: Введите новый возраст

# choose_new_gender
source: Choose your gender
ru: Выберите свой пол

# choose_new_interesting_gender
source: Choose the gender you are interested in
ru: Выберите интересующий вас пол

# enter_new_city
source: Which city are you from?
ru: Из какого вы города?

# enter_new_about
source: Enter new text for your profile
ru: Введите новый текст для вашей анкеты

# send_new_media
source: Send new media for your profile
ru: Отправьте новые медиа для вашей анкеты

# name_updated
source: Name has been updated
ru: Имя обновлено

# age_updated
source: Age has been updated
ru: Возраст обновлен

# gender_updated
source: Gender has been updated
ru: Пол обновлен

# interesting_gender_updated
source: Interested gender has been updated
ru: Интересующий пол обновлен

# city_updated
source: City has been updated
ru: Город обновлен

# about_updated
source: Profile text has been updated
ru: Текст анкеты обновлен

# media_updated
source: Media has been updated
ru: Медиа обновлены

# max_media_reached
source: Maximum number of media reached
ru: Достигнуто максимальное число медиа

source: Profile already exists
ru: Анкета уже существует

# geo_notification_waited
source: Finding great matches for you... Just a moment! While we're searching, feel free to browse random profiles
ru: Ищем подходящие анкеты... Пожалуйста, подождите немного. Пока вы можете смотреть случайные анкеты

# geo_notification_success
source: Perfect! Your personalized recommendations are ready
ru: Всё готово! Рекомендации настроены

# geo_notification_failed
source: We couldn't detect your location. You can try again or share your current location. Also you can continue browsing random profiles
ru: Не удалось определить ваше местоположение. Пожалуйста, попробуйте еще раз или отправьте вашу текущую локацию, также вы можете продолжить смотреть случайные анкеты
